* Description
 Given two binary trees and imagine that when you put one of them to cover the other, some nodes of the two trees are overlapped while the others are not.

You need to merge them into a new binary tree. The merge rule is that if two nodes overlap, then sum node values up as the new value of the merged node. Otherwise, the NOT null node will be used as the node of new tree.
* Solution
#+BEGIN_SRC cpp
  #include <iostream>
  using namespace std;

  struct TreeNode {
    int val;
    TreeNode *left;
    TreeNode *right;
    TreeNode(int x) : val(x), left(NULL), right(NULL) {}
  };
  class Solution {
  public:
    TreeNode *mergeTrees(TreeNode *t1, TreeNode *t2) {
      if (t1 == NULL) {
        return t2;
      }
      if (t2 == NULL) {
        return t1;
      }
      t1->val += t2->val;
      t1->left = mergeTrees(t1->left, t2->left);
      t1->right = mergeTrees(t1->right, t2->right);
      return t1;
    }
  };

  int main(int argc, char *argv[]) {
    Solution solution = Solution();
    TreeNode tree = TreeNode(12);
    solution.mergeTrees(&tree, &tree);
    cout << tree.val;
    return 0;
  }
#+END_SRC

#+RESULTS:
: 24
